name: "CaffeNet"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }

# mean pixel / channel-wise mean instead of mean image
  transform_param {
    crop_size: 32
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: true
  }
  data_param {
    source: "D:/_test/train/img_train_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }

# mean pixel / channel-wise mean instead of mean image
  transform_param {
    crop_size: 32
     mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: false
  }
  data_param {
    source: "D:/_test/train/img_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 3
    stride: 1
    pad:1
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


layer {
	bottom: "conv1"
	top: "conv1"
	name: "bn_conv1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
}

layer {
	bottom: "conv1"
	top: "conv1"
	name: "scale_conv1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}


layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}

############
layer {
	bottom: "conv2"
	top: "conv2"
	name: "bn_conv2"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv2"
	top: "conv2"
	name: "scale_conv2"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
################

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

#layer {
#  name: "norm2"
#  type: "LRN"
#  bottom: "pool2"
 # top: "norm2"
 # lrn_param {
 #   local_size: 5
 #   alpha: 0.0001
 #   beta: 0.75
 # }
#}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


############
layer {
	bottom: "conv3"
	top: "conv3"
	name: "bn_conv3"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
}

layer {
	bottom: "conv3"
	top: "conv3"
	name: "scale_conv3"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
################

layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


############
layer {
	bottom: "conv4"
	top: "conv4"
	name: "bn_conv4"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv4"
	top: "conv4"
	name: "scale_conv4"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
################

layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}

layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    stride: 2
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}



############
layer {
	bottom: "conv5"
	top: "conv5"
	name: "bn_conv5"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv5"
	top: "conv5"
	name: "scale_conv5"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
################


layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}



layer {
  name: "conv6"
  type: "Convolution"
  bottom: "conv5"
  top: "conv6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}



############
layer {
	bottom: "conv6"
	top: "conv6"
	name: "bn_conv6"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv6"
	top: "conv6"
	name: "scale_conv6"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
################

layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv6"
  top: "conv6"
}




###========================
layer {
  name: "conv7"
  type: "Convolution"
  bottom: "conv6"
  top: "conv7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv7"
	top: "conv7"
	name: "bn_conv7"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv7"
	top: "conv7"
	name: "scale_conv7"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu7"
  type: "ReLU"
  bottom: "conv7"
  top: "conv7"
}


###========================
layer {
  name: "conv8"
  type: "Convolution"
  bottom: "conv7"
  top: "conv8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv8"
	top: "conv8"
	name: "bn_conv8"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv8"
	top: "conv8"
	name: "scale_conv8"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu8"
  type: "ReLU"
  bottom: "conv8"
  top: "conv8"
}



###========================
layer {
  name: "conv9"
  type: "Convolution"
  bottom: "conv8"
  top: "conv9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv9"
	top: "conv9"
	name: "bn_conv9"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv9"
	top: "conv9"
	name: "scale_conv9"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu9"
  type: "ReLU"
  bottom: "conv9"
  top: "conv9"
}



###========================
layer {
  name: "conv10"
  type: "Convolution"
  bottom: "conv9"
  top: "conv10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 2
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv10"
	top: "conv10"
	name: "bn_conv10"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv10"
	top: "conv10"
	name: "scale_conv10"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu10"
  type: "ReLU"
  bottom: "conv10"
  top: "conv10"
}




###========================
layer {
  name: "conv11"
  type: "Convolution"
  bottom: "conv10"
  top: "conv11"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv11"
	top: "conv11"
	name: "bn_conv11"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv11"
	top: "conv11"
	name: "scale_conv11"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu11"
  type: "ReLU"
  bottom: "conv11"
  top: "conv11"
}



###========================
layer {
  name: "conv12"
  type: "Convolution"
  bottom: "conv11"
  top: "conv12"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv12"
	top: "conv12"
	name: "bn_conv12"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv12"
	top: "conv12"
	name: "scale_conv12"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu12"
  type: "ReLU"
  bottom: "conv12"
  top: "conv12"
}



###========================
layer {
  name: "conv13"
  type: "Convolution"
  bottom: "conv12"
  top: "conv13"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv13"
	top: "conv13"
	name: "bn_conv13"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv13"
	top: "conv13"
	name: "scale_conv13"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu13"
  type: "ReLU"
  bottom: "conv13"
  top: "conv13"
}




###========================
layer {
  name: "conv14"
  type: "Convolution"
  bottom: "conv13"
  top: "conv14"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv14"
	top: "conv14"
	name: "bn_conv14"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv14"
	top: "conv14"
	name: "scale_conv14"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu14"
  type: "ReLU"
  bottom: "conv14"
  top: "conv14"
}




###========================
layer {
  name: "conv15"
  type: "Convolution"
  bottom: "conv14"
  top: "conv15"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 2
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv15"
	top: "conv15"
	name: "bn_conv15"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv15"
	top: "conv15"
	name: "scale_conv15"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu15"
  type: "ReLU"
  bottom: "conv15"
  top: "conv15"
}



###========================
layer {
  name: "conv16"
  type: "Convolution"
  bottom: "conv15"
  top: "conv16"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv16"
	top: "conv16"
	name: "bn_conv16"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv16"
	top: "conv16"
	name: "scale_conv16"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu16"
  type: "ReLU"
  bottom: "conv16"
  top: "conv16"
}






###========================
layer {
  name: "conv17"
  type: "Convolution"
  bottom: "conv16"
  top: "conv17"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv17"
	top: "conv17"
	name: "bn_conv17"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv17"
	top: "conv17"
	name: "scale_conv17"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu17"
  type: "ReLU"
  bottom: "conv17"
  top: "conv17"
}



###========================
layer {
  name: "conv18"
  type: "Convolution"
  bottom: "conv17"
  top: "conv18"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv18"
	top: "conv18"
	name: "bn_conv17"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv18"
	top: "conv18"
	name: "scale_conv18"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu18"
  type: "ReLU"
  bottom: "conv18"
  top: "conv18"
}



###========================
layer {
  name: "conv19"
  type: "Convolution"
  bottom: "conv18"
  top: "conv19"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv19"
	top: "conv19"
	name: "bn_conv19"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv19"
	top: "conv19"
	name: "scale_conv19"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu19"
  type: "ReLU"
  bottom: "conv19"
  top: "conv19"
}



###========================
layer {
  name: "conv20"
  type: "Convolution"
  bottom: "conv19"
  top: "conv20"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    stride: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
	bottom: "conv20"
	top: "conv20"
	name: "bn_conv20"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: false
	}
 
}

layer {
	bottom: "conv20"
	top: "conv20"
	name: "scale_conv20"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

layer {
  name: "relu20"
  type: "ReLU"
  bottom: "conv20"
  top: "conv20"
}


####################################################
layer {
  name: "pool21"
  type: "Pooling"
  bottom: "conv20"
  top: "pool21"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

layer {
  name: "fc22"
  type: "InnerProduct"
  bottom: "pool21"
  top: "fc22"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
      variance_norm: FAN_IN
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc22"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc22"
  bottom: "label"
  top: "loss"
}
